docs/junits/junits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JUnit Tests</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">JUnit Tests</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org34e24d9">&lt; Back Home</a></li>
<li><a href="#orgb078f03">Overview</a></li>
<li><a href="#org9da1410">Why?</a></li>
<li><a href="#org3e54fbf">How?</a></li>
<li><a href="#orgebf3f64">Reflection</a></li>
</ul>
</div>
</div>
<div id="outline-container-org34e24d9" class="outline-2">
<h2 id="org34e24d9"><a href="../index.html">&lt; Back Home</a></h2>
</div>

<div id="outline-container-orgb078f03" class="outline-2">
<h2 id="orgb078f03">Overview</h2>
<div class="outline-text-2" id="text-orgb078f03">
<p>
In my Object-Oriented Programming (CS 1331) and Data Structures/Algorithsm (CS 1332) classes,
students are encouraged to share tester files for the homework assignments on the class forum.
My friend and I began working together to write the most elegant, thorough, and compartmentalized
tester files to monopolize the test case market.
</p>
</div>
</div>
<div id="outline-container-org9da1410" class="outline-2">
<h2 id="org9da1410">Why?</h2>
<div class="outline-text-2" id="text-org9da1410">
<p>
For those classes, although we were not permitted to share our individual homework code,
we were highly encourage to share tester ("driver") files to check each method's functionality.
We had three reasons for writing extensive tester files:
</p>
<ol class="org-ol">
<li><b>To help our classmates debug.</b> A good set of a unit tests will significantly aid
the debugging process by pointing out which specifications your code does not yet meet.</li>
<li><b>To encourage our classmates to keep working on their code.</b> If there were no test cases
to fail, then students may not realize that their code doesn't meet the specifications.</li>
<li><b>To test our own code.</b> Even if we didn't want to help our classmates, we would still need
to test our own code extensively before submission.</li>
</ol>
</div>
</div>
<div id="outline-container-org3e54fbf" class="outline-2">
<h2 id="org3e54fbf">How?</h2>
<div class="outline-text-2" id="text-org3e54fbf">
<p>
Although the homeworks were all in Java, we did not want to use the JUnit library initially.
Using the JUnit library would require all other students to install the correct JUnit
version to their own IDEs, or to download a <code>.jar</code> file and add it to their classpath, which
was outside of the scope of the class. In order to maximize our tester files' reach, we
limited ourselves to just one <code>.java</code> file with no external dependencies. This raised
a variety of technical challenges, which you can read about on <a href="https://rydersecondbrain.netlify.app/docs/automated-driver-testing">Ryder's Blog</a>.
</p>

<p>
Our notable features included:
</p>
<ul class="org-ul">
<li>Console I/O testing</li>
<li>Custom annotations-based system to print debugging tips for every single test case</li>
<li>File I/O testing (with file creation, checking, and cleanup included)</li>
<li>Java Reflections-based tests to call private fields and methods</li>
<li>Reflections-based initialization to avoid dependence on correct constructors</li>
<li><b>Over 25,000 lines of published code, with an estimated 4,000+ downloads</b></li>
<li>Brute force testing of binary trees, AVLs, and other data structures, with compressed &amp; encoded data stored in Strings</li>
<li>ASCII-based console output to illustrate trees, lists, heaps, and hash maps in console output</li>
<li>Multi-threading to timeout tests in the case of an infinite loop</li>
<li>Zero missed homework testers for two semesters</li>
</ul>
</div>
</div>
<div id="outline-container-orgebf3f64" class="outline-2">
<h2 id="orgebf3f64">Reflection</h2>
<div class="outline-text-2" id="text-orgebf3f64">
<p>
When I started writing tester files, I had no idea how far they would take me. By writing these
test cases every week, I started to gain name recognition among my classmates, TAs, and even
my professors. Because of these tester files, I became a TA for the Object Oriented Programming
class and was able to contribute to the course's autograder.
</p>

<p>
By writing hundreds of test cases week after week, I gained firsthand experience with
test-driven development. Some weeks, I experimented with writing test cases before writing
my own homework to minimize how many edge cases slip through the cracks. By making these
files, I've spent dozens of hours writing code in a way that is not just functional,
but thoroughly testable. Although writing unit tests are often the least-favorite part
of development, I've gained an appreciation for their functionality and necessity.
</p>

<p>
Also, just as a personal note, the name recognition spread much further than I thought it would.
I've been introduced to new friends and classmates as "the test driver guy" and been immediately
met with enthusiastic "thank-you"s, and I really appreciated the support throughout the year. It
was a long, unforseen journey, but every test case was a small step in the right direction.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
